In [16]:
%matplotlib inline
import pandas as pd

In [17]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [18]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                title  year
0    Nyhtoperpatimata  1964
1  Magnong Mandurukot  1963
2       The Messenger  2009
3    Rammstein: Paris  2016
4  In the Blue Ground  1999

In [19]:
cast = pd.read_csv('data/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [20]:
len(titles)

244914

In [21]:
titles.describe(include='all')

         title           year
count   244914  244914.000000
unique  223828            NaN
top     Hamlet            NaN
freq        20            NaN
mean       NaN    1986.616012
std        NaN      29.459912
min        NaN    1894.000000
25%        NaN    1967.000000
50%        NaN    1997.000000
75%        NaN    2012.000000
max        NaN    2115.000000

### What are the earliest two films listed in the titles dataframe?

In [65]:
t = titles
t.sort_values('year').head(2)

                     title  year
99216           Miss Jerry  1894
214769  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [68]:
ham = t[t.title == 'Hamlet']
len(ham)

20

### How many movies are titled "North by Northwest"?

In [67]:
len(t[t.title == "North by Northwest"])

1

### When was the first movie titled "Hamlet" made?

In [72]:
ham.sort_values('year').head(1)

         title  year
191630  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [76]:
tres = t[t.title == "Treasure Island"].sort_values('year')
tres

                  title  year
211572  Treasure Island  1918
146357  Treasure Island  1920
122731  Treasure Island  1934
10501   Treasure Island  1950
133947  Treasure Island  1972
113656  Treasure Island  1973
24015   Treasure Island  1985
42244   Treasure Island  1999

### How many movies were made in the year 1950?

In [77]:
len(t[t.year == 1950])

1113

### How many movies were made in the year 1960?

In [78]:
len(t[t.year == 1960])

1549

### How many movies were made from 1950 through 1959?

In [79]:
len(t[(t.year >= 1950) & (t.year < 1960)])

12934

### In what years has a movie titled "Batman" been released?

In [85]:
t[t.title == "Batman"]

         title  year
138810  Batman  1989
159939  Batman  1943

### How many roles were there in the movie "Inception"?

In [89]:
c = cast
i = c[c.title == "Inception"]
len(i)

78

In [90]:
i.head()

,title,year,name,type,character,n
98153,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
149008,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
183937,Inception,2010,Tom Berenger,actor,Browning,8.0
197877,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
260128,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [91]:
len(i[i.n.isnull()])

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [92]:
len(i[i.n.notnull()])

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [98]:
n = cast[cast.title == "North by Northwest"]
n[n.n.notnull()].sort_values('n')

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [102]:
s = cast[(cast.title == "Sleuth") & (cast.year == 1972)].sort_values("n")
# if only names are wanted, reduce to Series 
# s['name']
s

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

### How many roles were credited in the silent 1921 version of Hamlet?

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

### How many "Hamlet" roles have been listed in all film credits through history?

### How many people have played an "Ophelia"?

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

### How many roles has Sidney Poitier played throughout his career?

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were available for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

## _Tips to get you started with the first set of exercises_

In [22]:
# Number of Rows
len(titles)

244914

In [23]:
# .head() and .tail() create a new DataFrame
# they are actually slicing and not just showing a part of the frame

# Overview
h = titles.head()
h

                title  year
0    Nyhtoperpatimata  1964
1  Magnong Mandurukot  1963
2       The Messenger  2009
3    Rammstein: Paris  2016
4  In the Blue Ground  1999

In [24]:
# Overview from below
titles.tail()

                              title  year
244909      Alting bliver godt igen  2010
244910                   Wa wa bing  1989
244911                   Gift Horse  1952
244912         Frau Warrens Gewerbe  1960
244913  Revolution of Everyday Life  2010

### Filtering

In [25]:
# Creates a Series
# Series let you do math as if you were working with just one object -> vectorization
year = h['year']
year - 2000

0   -36
1   -37
2     9
3    16
4    -1
Name: year, dtype: int64

In [26]:
year // 10 * 10

0    1960
1    1960
2    2000
3    2010
4    1990
Name: year, dtype: int64

In [27]:
# we can also access the Series through the dot-operator
h.year

0    1964
1    1963
2    2009
3    2016
4    1999
Name: year, dtype: int64

In [28]:
# do boolean operations and receive a boolean series
h.year > 1985

0    False
1    False
2     True
3     True
4     True
Name: year, dtype: bool

In [29]:
# filtering the DataFrame by 
h[(h.year > 1985) & (h.year < 2015)]

# This one throws an exception since "and" is a hardcoded python operation working on two singular boolean values
# We are working on vectors though, so no worky
# h[(h.year > 1985) and (h.year < 2015)]

                title  year
2       The Messenger  2009
4  In the Blue Ground  1999

In [30]:
h[(h.year < 1980) | (h.year >= 2013)]

                title  year
0    Nyhtoperpatimata  1964
1  Magnong Mandurukot  1963
3    Rammstein: Paris  2016

In [39]:
t = titles
t[t.title == 'Macbeth'].sort_values('year').tail()

          title  year
147635  Macbeth  2013
9584    Macbeth  2014
70195   Macbeth  2015
138003  Macbeth  2017
61214   Macbeth  2018

In [47]:
t['title'].sort_index().head()

0      Nyhtoperpatimata
1    Magnong Mandurukot
2         The Messenger
3      Rammstein: Paris
4    In the Blue Ground
Name: title, dtype: object

In [49]:
t['title'].sort_values().tail()

218846                within silence
14986                    www.XXX.com
178368                           xXx
86211     xXx: Return of Xander Cage
182901       xXx: State of the Union
Name: title, dtype: object

In [62]:
h = cast.head()
not_null = h[h.n.notnull()]
is_null = h[h.n.isnull()]
is_null

                  title  year     name   type                character   n
3  Secret in Their Eyes  2015  $hutter  actor          2002 Dodger Fan NaN
4            Steve Jobs  2015  $hutter  actor  1988 Opera House Patron NaN

In [63]:
not_null

                 title  year      name   type        character     n
0       Closet Monster  2015  Buffy #1  actor          Buffy 4  31.0
1      Suuri illusioni  1985    Homo $  actor           Guests  22.0
2  Battle of the Sexes  2017   $hutter  actor  Bobby Riggs Fan  10.0